#!/bin/bash

#ver_0.1 
#поиск только в директориях указанных в TARGET_DIR

ROOT_DIR="/volume1/gr030cvp"
TARGET_DIR="011000_tmp 011001_Ардатов 011002_Атюрьево 011003_Атяшево 011004_Большие_Березники \
           011005_Большое_Игнатово 011006_Дубенки 011007_Ельники 011008_Зубова_Поляна \
		   011009_Инсар 011010_Ичалки 011011_Ковылкино 011012_Кочкурово 011013_Краснослободск \
		   011014_Лямбирь 011015_Ромоданово 011016_Рузаевка 011017_Старое_Шайгово \
		   011018_Темников 011019_Теньгушево 011020_Торбеево 011021_Чамзинка 011022_Кадошкино 011023_Саранск" 
cd "${ROOT_DIR}" || exit 1
for i in ${TARGET_DIR}
do
(cd ${i}
for i in ${TARGET_DIR}
do
if [ -d "${i}" ]
then
readlink -f $i
mv "${i}" "${ROOT_DIR}"
fi
done)
done
